// დავალებები
//პროექტი 19 - Paint Calculator - საღებავის კალკულატორი
//ზოგჯერ, დამრგვალების სტანდარტული წესების ნაცვლად, გვიწევს, რიცხვი მომდევნო რიცხვზე დავამრგვალოთ.
// გამოთვალეთ საღებავი გალონებში, რომელიც ოთახის ჭერის შესაღებადაა საჭირო. პროგრამამ input-ად უნდა მოითხოვოს
// ოთახის სიგრძე და სიგანე. ჩავთვალოთ, რომ ერთი გალონი 350 კვადრატულ ფუტს მოიცავს. მთელი რიცხვით აჩვენეთ გალონების
// ის რაოდენობა, რაც საჭიროა ჭერის შესაღებად.
//მაგალითად:
//shell
//> You will need to purchase 2 gallons of paint to cover 360 square feet.
//გახსოვდეთ - გალონი საღებავის ნაწილის შეძენა არ შეგიძლიათ, რიცხვი მომდევნო მთელ რიცხვზე - მთელ გალონზე უნდა დაამრგვალოთ.


// პროექტი 20 - Self-Checkout - თვით-გადახდა
//შექმენით მარტივი გადახდის სისტემა, რომლითაც მომხმარებელი შეძენილი პროდუქტების ფასს გამოითვლის. პროგრამამ input-ად უნდა 
//მოითხოვოს სამი ნივთის ფასები და თითოეულის რაოდენობა. გამოთვალეთ მათი საერთო ფასი. შემდეგ, გამოთვალეთ
// დამატებითი - 5.5%-იანი გადასახადი (tax). საბოლოოდ, პროგრამამ უნდა დაბეჭდოს პროდუქტების ფასი, გადასახადი და
// მთლიანი გადასახდელი თანხა - ანუ ფასისა და გადასახადის ჯამი.
//მაგალითად:
//shell
// Enter the price of item 1: 25
// Enter the quantity of item 1: 2
// Enter the price of item 2: 10
// Enter the quantity of item 2: 1
// Enter the price of item 3: 4
// Enter the quantity of item 3: 1
// Subtotal: $64.00
//Tax: $3.52
// Total: $67.52
//თქვენი პროგრამის input-ების, კალკულაციებისა და output-ების ნაწილები ერთმანეთისგან გამიჯნეთ.


//პროექტი 21 - Currency Conversion - ვალუტის კონვერტაცია
//ზოგჯერ შეიძლება დაგჭირდეთ ვალუტის გაცვლის კურსებთან შეხება და უნდა დარწმუნდეთ, რომ თქვენი გამოთვლები მაქსიმალურად ზუსტია.

//დაწერეთ პროგრამა, რომელიც გარდაქმნის ვალუტას. კერძოდ, გადააკეთეთ ევრო აშშ დოლარში. მოითხოვეთ თანხის რაოდენობა ევროში და ევროს მიმდინარე კურსი. ამობეჭდეთ ახალი თანხა  დოლარში.

//ვალუტის კონცერტაციის ფორმულაა:

//amount to = (amount from * rate from ) / rate to

//სადაც: 
// Amount to არის თანხა დოლარში
// Amount from არის თანხა ევროში
// rate from არის მიმდინარე გაცვლითი კურსი ევროში
// rate to არის აშშ დოლარის მიმდინარე გაცვლითი კურსი

//მაგალითად:
//shell
//How many euros are you exchanging? 81
// What is the exchange rate? 137.51
// 81 euros at an exchange rate of 137.51 is 111.38 U.S. dollars.


// პროექტი 22 - Computing Simple Interest - მარტივი პროცენტის გამოთვლა
//მარტივი პროცენტის გამოთვლა შესანიშნავი გზაა იმის სწრაფად გასარკვევად, აქვს თუ არა ინვესტიციას ღირებულება. შექმენით პროგრამა, რომელიც გამოითვლის მარტივ პროცენტს. Input-ად მოითხოვეთ ძირითადი თანხა, განაკვეთი პროცენტში და, შემდეგ კი აჩვენეთ დარიცხული თანხა (ძირი + პროცენტი). მარტივი პროცენტის ფორმულა არის A = P(1 + rt), სადაც P არის ძირითადი თანხა, r არის წლიური საპროცენტო განაკვეთი, t არის წლების რაოდენობა და A არის თანხა ინვესტიციის დასრულებისას.

//მაგალითად:
//shell
// Enter the principal: 1500
// Enter the rate of interest: 4.3
// Enter the number of years: 4
// After 4 years at 4.3%, the investment will be worth $1758.
